class Analyzer:

    single_valid_positive = {
        "type": "singlechoice_test",
        "data": {
            "user_answer_id": 2,
            "task": {
                "correct_answer_id": 2,
                "answers": [
                    {
                        "text": "Умножение",
                        "hint": "Название говорит само за себя"
                    },
                    {
                        "text": "Вычитание",
                        "hint": "Перечитай главу"
                    },
                    {
                        "text": "Сложение",
                        "hint": "Все верно"
                    }
                ]
            }
        }
    }
    multi_valid_positive = {
        "type": "multichoice_test",
        "data": {
            "user_answers": [
                True,
                True
            ],
            "task": {
                "correct_answers": [
                    True,
                    True
                ]
            }
        }
    }
    code_valid_positive = {
        "type": "program",
        "data": {
            "user_signals": [
                {
                    "name": "Sum[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1101",
                        "b1000"
                    ]
                },
                {
                    "name": "Cout",
                    "wave": "0.......................1.....",
                    "data": []
                },
                {
                    "name": "A[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1010",
                        "b1101"
                    ]
                },
                {
                    "name": "B[0:3]",
                    "wave": "=.....................=.=.....",
                    "data": [
                        "b0",
                        "b11",
                        "b1010"
                    ]
                },
                {
                    "name": "Cin",
                    "wave": "0.......................1.....",
                    "data": []
                }
            ],
            "correct_signals": [
                {
                    "name": "Sum[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1101",
                        "b1000"
                    ]
                },
                {
                    "name": "Cout",
                    "wave": "0.......................1.....",
                    "data": []
                },
                {
                    "name": "A[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1010",
                        "b1101"
                    ]
                },
                {
                    "name": "B[0:3]",
                    "wave": "=.....................=.=.....",
                    "data": [
                        "b0",
                        "b11",
                        "b1010"
                    ]
                },
                {
                    "name": "Cin",
                    "wave": "0.......................1.....",
                    "data": []
                }
            ]
        }
    }
    code_valid_negative = {
        "type": "program",
        "data": {
            "user_signals": [
                {
                    "name": "Sum[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b01",
                        "b1",
                        "b1101",
                        "b1000"
                    ]
                },
                {
                    "name": "Cout1",
                    "wave": "0.......................1.....",
                    "data": []
                },
                {
                    "name": "A[0:3]1",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1010",
                        "b1101"
                    ]
                },
                {
                    "name": "B[0:3]",
                    "wave": "=.....................=.=.....",
                    "data": [
                        "b0",
                        "b11",
                        "b1010"
                    ]
                },
                {
                    "name": "Cin",
                    "wave": "0.......................1.....",
                    "data": []
                }
            ],
            "correct_signals": [
                {
                    "name": "Sum[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1101",
                        "b1000"
                    ]
                },
                {
                    "name": "Cout",
                    "wave": "0.......................1.....",
                    "data": []
                },
                {
                    "name": "A[0:3]",
                    "wave": "=...................=.=.=.....",
                    "data": [
                        "b0",
                        "b1",
                        "b1010",
                        "b1101"
                    ]
                },
                {
                    "name": "B[0:3]",
                    "wave": "=.....................=.=.....",
                    "data": [
                        "b0",
                        "b11",
                        "b1010"
                    ]
                },
                {
                    "name": "Cin",
                    "wave": "0.......................1.....",
                    "data": []
                }
            ]
        }
    }
